Revit 2024 API
PipeFittingAndAccessoryPressureDropItem Class
 A flow path of the pipe/pipe fitting and accessory. It is defined by the begin connector and end connector
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class PipeFittingAndAccessoryPressureDropItem : IDisposable
Visual Basic
Public Class PipeFittingAndAccessoryPressureDropItem _
	Implements IDisposable
Visual C++
public ref class PipeFittingAndAccessoryPressureDropItem : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem
See Also
PipeFittingAndAccessoryPressureDropItem Members
Autodesk.Revit.DB.Plumbing Namespace